{
    "books": [
        {
            "isbn": "978-0131103627",
            "title": "Titus the T-Rex",
            "styles": "kids-1",
            "summary": "A shy T-rex with too-short arms dares to join the forest band, discovering that rhythm can come in unexpected forms. When conventional drums feel out of reach, he turns a problem into his greatest strength—and finds a new way to belong. In the end, the beat of courage echoes louder than any instrument.",
            "progress": 60,
            "coverBackImage": "/assets/img/books/kids-1/book-cover-back-kids1.png",
            "coverImage": "/assets/img/books/kids-1/book-cover-kids1.png",
            "frontImage": "/assets/img/books/kids-1/kids1-front.png",
            "backImage": "/assets/img/books/kids-1/kids1-back.png",
            "pages": [
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/1.png"
                },
                {
                    "type": "templateText",
                    "title": "1. Lonely Wish",
                    "text": "Titus stands alone in the clearing, his tiny arms folded and a single tear rolling down his cheek. He gazes longingly at the distant band, wishing he could join in their music. His heart aches because he knows his short arms make it hard to hold an instrument."
                },
                {
                    "type": "templateText",
                    "title": "2. Hopeful Offer",
                    "text": "Gathered around a guitar, saxophone, and drums, the band members chatter excitedly—but stop when Titus approaches. He offers to play, hopeful and nervous, clutching his stubby arms to his chest. Their faces fall as they exchange worried glances."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/2.png"
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/3.png"
                },
                {
                    "type": "templateText",
                    "title": "3. Doubtful Heads",
                    "text": "The triceratops drummer and pterodactyl saxophonist shake their heads sadly at Titus. They explain gently that no one has ever played with arms so short and brass instruments so heavy. Titus’s shoulders slump as he realizes they doubt his ability."
                },
                {
                    "type": "templateText",
                    "title": "4. Stubborn Try",
                    "text": "Determined not to give up, Titus stomps onto a wooden platform and tries to reach the drumsticks. He watches in frustration as the sticks clatter out of reach. His dinosaur friends look on with sympathy—and a little surprise at his persistence."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/4.png"
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/5.png"
                },
                {
                    "type": "templateText",
                    "title": "5. First Beat",
                    "text": "At last, the band gives Titus a chance: they place a big bass drum in front of him. With a deep breath, he raises his tiny foot and stomps the drum in perfect time. His face lights up in a huge grin as the beat thunders through the forest."
                },
                {
                    "type": "templateText",
                    "title": "6. Triumphant Finale",
                    "text": "Under a sky twinkling with fireflies, Titus proudly leads the band in a triumphant finale. His friends cheer and clap as he stomps each beat with joyful confidence. At last, Titus belongs—his courage and rhythm bringing the whole band together."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-1/6.png"
                }
            ]
        },
        {
            "isbn": "978-0140449136",
            "title": "Dinosaur Instincts",
            "styles": "adults-1",
            "summary": "Dinosaur Instincts is a vivid journey through eleven remarkable dinosaurs—from armored Ankylosaurus to towering Brachiosaurus—revealing their hatching, feeding habits, anatomy, and behaviors with stunning watercolor–style art.",
            "progress": 60,
            "image": "/assets/img/bg/base.png",
            "coverBackImage": "/assets/img/books/adults-1/book-cover-back-adults1.png",
            "coverImage": "/assets/img/books/adults-1/book-cover-adults1.png",
            "frontImage": "/assets/img/books/adults-1/adults1-front.png",
            "backImage": "/assets/img/books/adults-1/adults1-back.png",
            "pages": [
                {
                    "type": "templateImageLeft",
                    "title": "Ankylosaurus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/ankylosaurus/ankylosaurus-birth.png",
                    "text": "Ankylosaurus embryos formed in sturdy eggshells balancing porosity and strength for gas exchange. Histology shows ossicle formation initiated already before pipping, conferring immediate armor. Nests comprised shallow scrapes in sediment, leveraging ambient warmth to coordinate emergence. Clutch sizes ranged from six to ten eggs, each roughly twenty-five centimeters long, reflecting parental care and fueling early yolk-driven growth.\n\nAnkylosaurus embryos formed in sturdy eggshells balancing porosity and strength for gas exchange. Histology shows ossicle formation initiated already before pipping, conferring immediate armor. Nests comprised shallow scrapes in sediment, leveraging ambient warmth to coordinate emergence. Clutch sizes ranged from six to ten eggs, each roughly twenty-five centimeters long, reflecting parental care and fueling early yolk-driven growth."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Ankylosaurus bore a broad, low muzzle with leaf-shaped teeth for cropping low vegetation. Its reinforced skull housed powerful jaw muscles able to shear tough foliage. A keratinous beak prepped shoots before occlusion, while molariform teeth ground plant matter. A capacious gut with fermentation chambers maximized nutrient extraction. Foraging was slow and deliberate, with sweeping movements of the snout across ground cover. The tail club was likely held aloft during feeding to deter ambush predators. Individuals likely foraged in small family groups along floodplain margins, tracking seasonal growth.",
                    "foodName": "Horsetails",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/ankylosaurus/ankylosaurus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/ankylosaurus/ankylosaurus-food-2.png",
                    "lowerText": "Ankylosaurus primarily consumed low-growing vegetation such as ferns, horsetails, and cycads, cropping foliage with its broad beak and grinding it between leaf-shaped teeth. Its jaw architecture and gut adaptations processed fibrous plant matter efficiently. Seasonal shifts may have led to selective browsing of angiosperm shoots near floodplains, supplementing its diet with tough stems."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/ankylosaurus/ankylosaurus-characteristics.png",
                    "text": "Ankylosaurus was a heavily armored quadrupedal dinosaur reaching lengths of six to eight meters, its broad body shielded by fused osteoderms that formed a continuous protective armor. The low, triangular skull featured bony plates and reinforced jaws, while stout limbs bore massive weight. Its distinctive tail club served as a powerful defensive weapon. Estimated at six tonnes it inhabited floodplains its profile deterring predators."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Ankylosaurus displayed predominantly solitary behavior foraging slowly along floodplain undergrowth with a low-slung posture to crop low vegetation. When disturbed by predators it adopted a defensive stance, raising its armored osteoderms and swinging its massive tail club in forceful lateral arcs. Trackway evidence indicates limited gregariousness, suggesting that individuals rarely moved in coordinated groups. Osteoderm patterns and club morphology may have served intraspecific display or recognition. Bone histology and tooth microwear imply crepuscular feeding cycles, reducing midday heat stress. Low-frequency bellows likely mediated long-distance communication, while tactile signaling among proximate individuals reinforced social bonds. Periodic movements between habitats remain hypothetical, inferred from isotopic variation in fossils. Resting was sedentary with individuals using thick cover for concealment and energy conservation.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/ankylosaurus/ankylosaurus-behaviour.png",
                    "lowerText": "High-resolution CT scans of Ankylosaurus specimens revealed a dense network of blood vessels and nerve channels within its cranial osteoderms, indicating that its iconic armor also functioned in sensory reception and thermoregulation, an exceptional adaptation overall."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Brachiosaurus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/brachiosaurus/brachiosaurus-birth.png",
                    "text": "Brachiosaurus eggs were laid in clusters within semi-arid floodplain environments, where heat from the tropical sun and organic detritus provided consistent incubation. Shell microstructure reveals pores adapted for moisture exchange, while embryonic bone histology demonstrates accelerated growth rates, preparing hatchlings for immediate quadrupedal support and rapid respiratory demands. Monsoon onset improved hatchling resource use.\n\nFossilized clutches attributed to Brachiosaurus display egg arrangement patterns consistent with philopatric nesting, suggesting repeated returns to ancestral sites. Sedimentological context indicates rapid burial events that preserved embryonic remains, enabling isotopic analysis of fluid exchange. Such evidence enhances understanding of sauropod reproductive strategies and paleoenvironmental adaptations. Rare isotopic data emerges."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Brachiosaurus used refined neck mechanics when feeding. Attachments guided head rotation for feeding effectiveness. Neural control enhanced feeding posture shift. Models confirm feeding reach under strain. FEA shows modulated cervical stress patterns during feeding. Pneumatic vertebrae lowered neck mass to enable movements. EMG analogs suggest muscle activation feeding cycles. Mandibular joint allowed lateral grinding during feeding. Trunk flexibility aided posture adjustment during feeding. Postures during feeding optimized energy expenditure. Studies of feeding mechanics refines sauropod morphology.",
                    "foodName": "araucarias",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/brachiosaurus/brachiosaurus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/brachiosaurus/brachiosaurus-food-2.png",
                    "lowerText": "Brachiosaurus was herbivorous. Gastroliths aided breakdown of plant material. Dental wear shows adaptation to vegetation abrasiveness. Microbial fermentation chambers optimized energy yield. Enlarged ceca and colon improved cellulose digestion. Seasonal resource shifts influenced fermentation rate. Hindgut retention time exceeded those of small herbivores."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/brachiosaurus/brachiosaurus-characteristics.png",
                    "text": "Brachiosaurus had an elongated neck with thirteen cervical vertebrae, each bearing pneumatic chambers that reduced skeletal weight. The forelimbs were proportionally longer than the hindlimbs, elevating the shoulder and granting a steep feeding posture. The sacral region supported a massive pelvis, anchoring strong hip musculature. A robust trunk housed extensive air sac diverticula, optimizing respiratory efficiency, aiding balance.\n\nDetailed cranial anatomy reveals a skull with proportionally small head size relative to body housing spoonshaped teeth arranged in parallel rows along elongated jaws. Mandibular articulation allowed lateral movements during browsing. Extensive pneumatic foramina permeated dorsal vertebrae enhancing mass reduction. Presacral air sacs penetrated neural canals. Ossified tendons stabilized tail and trunk segments against flexion forces."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Brachiosaurus likely traveled in cohesive herds across floodplain landscapes, exhibiting site fidelity during seasonal migrations aligned with monsoonal rainfall. Parallel trackway sets imply coordinated group movement at moderate pacing speeds, while juveniles occupied central positions for predator protection. Intraspecific communication may have included complex neck postures and low-frequency vocalizations, facilitated by elongated cervical air sacs and resonating cavities. Resting behaviors occurred in open clearings, with individuals adopting elevated stances for improved vigilance. Parental investment possibly encompassed nest defense and juvenile escorting through dense foliage. Migration routes likely followed riverine corridors and resource gradients across extensive floodplain ecosystems. Seasonal cohorts maintained optimal spacing to optimize resource use and reduce intergroup competition across varied terrain. Herd spacing!",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/brachiosaurus/brachiosaurus-behaviour.png",
                    "lowerText": "Analyses of Brachiosaurus specimens reveal pneumatic structures within vertebrae and ribs, enhancing respiratory efficiency. Elemental ratio from bone apatite traces seasonal habitat shifts. These findings refine interpretations of sauropod palaeobiology and ontogeny."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Coelophysis",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/coelophysis/coelophysis-birth.png",
                    "text": "Coelophysis embryos developed within elongated ovoid eggs incubated in shallow communal nests that formed in semi-arid flood basins. Sedimentological data indicate that nest mounds retained moisture and thermal stability. Eggshell microstructure analyses reveal high porosity to facilitate gas exchange in variable environments. Embryonic bone histology shows rapid ossification of limb and vertebral elements prior to hatching robustly.\n\nFossilized nests attributed to Coelophysis occur within floodplain silts interleaved with fine sandstone layers. Clutch arrangements demonstrate groupings, suggesting communal oviposition behaviors. Stable isotope assays on eggshell carbonate provide paleoclimate proxies and embryonic respiration data. Morphological examination of perinate bones reveals well-developed limb proportions and neural arch ossification prior to emergence."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Coelophysis possessed a narrow skull and lightly built jaws equipped with recurved, serrated teeth optimized for grasping small vertebrate prey. High gape angles enabled rapid snapping motions, while cervical flexibility allowed vertical and lateral head swings. Muscular attachment sites indicate powerful adductor muscles for forceful jaw closure. Feeding kinematics inferred from comparative analogs suggest rapid strikes aided by keen visual acuity. Cranial fenestrae reduced bone mass without compromising structural integrity during feeding sequences Biomechanical models outline strike velocity rates.",
                    "foodName": "beetles",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/coelophysis/coelophysis-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/coelophysis/coelophysis-food-2.png",
                    "lowerText": "Coelophysis was a small theropod carnivore that preyed on insects, lizards, and juvenile vertebrates. Toothed jaws facilitated efficient slicing of soft tissues. Stomach contents preserved within specimens include fish scales and small reptilian remains. Episodes of gizzard stones in gut indicate mechanical processing of food. Seasonal prey availability influenced foraging behaviors and energy expenditure."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/coelophysis/coelophysis-characteristics.png",
                    "text": "Coelophysis exhibited a lightweight, gracile frame with hollow limb bones and a long, flexible tail that maintained balance during fast bipedal locomotion. Its narrow skull housed blade-like teeth optimized for small prey capture. Cervical vertebrae were slender, supported by ossified tendons for neck stability. Pelvic articulation and elongated hind limbs enabled sustained cursorial efficiency. Hollow fenestrae reduced cranial mass.\n\nProportional limb ratios show hind limbs exceeded forelimbs by approximately thirty percent, supporting rapid acceleration. The compact pelvis bore robust muscle scars for agile locomotion. Bone histology reveals fast cortical growth during juvenile development. Tail chevrons increased lateral stability. Manual claw morphology suggests grasping precision. Braincase analyses indicate enlarged optic lobes and acute visual processing. ."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Coelophysis likely formed social groups, as indicated by multiple skeletons preserved together in floodplain bonebeds. Trackway assemblages attributed to this genus reveal parallel individuals moving at similar stride length, implying coordinated herding behavior. Such group dynamics may have enhanced predator detection and foraging efficiency. Rapid locomotion and agile turning were key defense strategies, supported by flexible tails and slender hind limbs. Vocalizations generated via an elongated hyoid apparatus likely facilitated low-frequency communication across habitats. Intraspecific interactions may have included tail displays and head-bobbing rituals for dominance establishment. Seasonal migrations along river corridors offered access to resources and fostered social cohesion. Evidence of healed bite wounds on bones indicates occasional aggression or competition within groups, further underscoring complex behavioral repertoire.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/coelophysis/coelophysis-behaviour.png",
                    "lowerText": "CT scans of Coelophysis specimens reveal extensive pneumatized cervical vertebrae and air sac extensions, indicating sophisticated respiratory adaptations. Rostral canal structures suggest refined olfactory capabilities. Data illuminate sensory and pulmonary evolution."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Compsognathus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/compsognathus/compsognathus-birth.png",
                    "text": "Compsognathus embryos hatched from tiny eggs each dawn.\n\n Embryonic bone reveals rapid limb, vertebral ossifications. Cranial fenestrae aided embryo, gas diffusion. Thermal sand preserved embryo heat evenly. Eggshell porosity modulated moisture retention in sediments. Embryonic limb proportions reveal locomotive competency  . Yolk sac supports vascular embryo metabolism  . Perinate mandibles show early ossification prior to emergence."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Compsognathus evolved precise neck articulation to snatch insect prey with minimal muscle effort. Cervical vertebrae bore enlarged articular surfaces for rapid strikes. Ligamentous recoil stored elastic energy during head retraction. Kinematic models demonstrate high-speed jaw closure at low cost. Serrated teeth engaged in rapid slicing while cranial fenestrae reduced skull mass, optimizing strike mechanics. Comparative FEA highlights stress distribution favorable for repeated feeding bouts. Neuromuscular analogs predict controlled activation patterns during prey capture. Flexible mandibular symphysis allowed slight lateral grinding between strikes.",
                    "foodName": "insects",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/compsognathus/compsognathus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/compsognathus/compsognathus-food-2.png",
                    "lowerText": "Compsognathus functioned as an opportunistic small-prey carnivore, targeting arthropods, crustaceans, and juvenile vertebrates. Conical teeth facilitated efficient puncture and retention of slippery prey. Fossilized gut contents include fish scales and diminutive reptilian bones."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/compsognathus/compsognathus-characteristics.png",
                    "text": "Compsognathus had a lightweight skeleton with hollow bones and a slender, counterbalancing tail enabling rapid agility.  Its narrow skull featured large antorbital fenestrae and a delicate mandible lined with fine serrated teeth.  Ossified tendons reinforced the dorsal vertebrae, while neural spines supported potent muscle attachments.  Filamentous integumentary traces suggest primitive feather presence for thermoregulation and display. Cranial kinesis aided capture.\n\nProportional limb ratios reveal elongated hindlimbs for cursorial prowess, with forelimbs featuring three grasping digits tipped by recurved claws.  The pelvis exhibited an open acetabulum, facilitating efficient limb rotation.  Braincase morphology indicates acute vision and coordination, while ossified sternal plates imply robust respiratory mechanics.  Adult body mass approximated three kilograms."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Compsognathus likely exhibited solitary or small-group behaviors, as fossil assemblages rarely exceeded handfuls of individuals.  High stride length differences in trackways indicate rapid pursuit behavior, while gracile tail musculature suggests agile maneuvering during evasion. Territorial displays may have included lateral body flaring and tail whipping. Seasonal patterns inferred from bonebed isotopes imply periodic congregation in resource-rich areas, possibly linked to mating or nesting. Intraspecific interactions likely involved visual signals and low-frequency vocalizations for social cohesion. Predation avoidance strategies favored burst sprints supported by lightweight anatomy. Limited nest guarding is inferred from taphonomic context but remains debated among paleontologists. Juveniles may have formed packs. Courtship likely involved head bobbing. Trackways indicate coordinated movement along floodplain corridors. Rare remains.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/compsognathus/compsognathus-behaviour.png",
                    "lowerText": "High-resolution CT scans of Compsognathus fossils reveal endocranial cavities and preserved muscle impressions, indicating pneumatic systems. Bone histology shows rapid juvenile growth and seasonal growth patterns."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Microceratus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/microceratus/microceratus-birth.png",
                    "text": "Microceratus eggs were deposited in shallow scrapes within sandy floodplain substrates, where diurnal temperature fluctuations drove embryonic development rates. Clutch arrangements suggest communal nesting zones, facilitating thermal regulation through substrate conductivity. Eggshell porosity analyses indicate adaptations for moisture diffusion in semi-arid contexts. Embryonic bone histology reveals accelerated ossification of limb elements for immediate post-hatch locomotion. Cranial ossification centers form early to support feeding behaviors upon emergence."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Microceratus developed a robust rostral beak and flexible jaw articulation to browse low-growing vegetation with minimal energy expenditure. Coronoid process hypertrophy provided enhanced muscle leverage for precise cropping motions. Mandibular kinesis reduced stress during repetitive biting sequences. Comparative jaw mechanics models highlight optimized bite force distribution across the dentary. Elongated cervical musculature supported sustained head movements during foraging bouts in dense undergrowth. Osteohistological data suggest rapid bone deposition under feeding loads.",
                    "foodName": "Cycads",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/microceratus/microceratus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/microceratus/microceratus-food-2.png",
                    "lowerText": "Microceratus subsisted on low-lying ferns, horsetails, and early angiosperm shoots, using its keratinous beak to shear tender plant tissues. Dental morphology indicates a preference for soft foliage with minimal grit abrasion. Pollen grains and phytoliths preserved in coprolites corroborate fern and cycad consumption. Seasonal shifts in preferred plant taxa likely influenced foraging range and gut retention times."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/microceratus/microceratus-characteristics.png",
                    "text": "Microceratus possessed a lightweight, gracile skeleton with elongated hindlimbs supporting agile bipedal locomotion. Its skull featured a broad rostral bone forming a keratinous beak and paired jugal horns of minimal projection. Cervical vertebrae exhibit ossified tendons for neck stabilization, while dorsal ribs incorporate ventrolateral flanges enhancing trunk rigidity. Limb proportions reveal a hindlimb-to-forelimb ratio exceeding 1.4, reflecting cursorial capacity. Filamentous integument traces on fossilized skin impressions suggest primitive protofeathers for thermoregulation and display.\n\nThe pelvic girdle displays an open acetabular structure permitting efficient limb cycling, and the sacral region includes three fused vertebrae anchoring robust hindlimb musculature."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Microceratus likely formed small social groups, as shown by bonebeds in fluvial deposits. Trackway sets exhibit parallel strides, implying coordinated locomotion for vigilance. Display behaviors may have included lateral body inflation, tail flicking, and head-bobbing conveying dominance or mating intent. Seasonal resource fluctuations drove periodic migrations along floodplain corridors to exploit grazing areas. Territorial calls, inferred from hyoid anatomy, facilitated group cohesion across habitats. Nest site selection appears opportunistic, with relocations following sediment deposition patterns. Evidence of healed bite marks suggests intra or interspecific confrontations, reflecting territorial disputes. Agile limb proportions and acceleration patterns in trackways underscore predator avoidance as a primary behavioral driver. Enlarged orbital and auditory features imply advanced sensory communication capabilities. New fossil data.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/microceratus/microceratus-behaviour.png",
                    "lowerText": "Microceratus bone histology reveals lines of arrested growth indicating seasonal metabolic modulation. CT imaging exposes expanded sinus cavities within nasal passages, suggesting enhanced olfactory capabilities."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Pachycephalosaurus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/pachycephalosaurus/pachycephalosaurus-birth.png",
                    "text": "Pachycephalosaurus embryos developed within shallow nests excavated in well‐drained floodplain soils, where diurnal temperature cycles regulated incubation depth. Eggshell microstructure shows elevated pore density to balance gas exchange and moisture retention in semi‐arid conditions. Histological analysis of embryonic long bones reveals early ossification of cranial domes, anticipating the characteristic thick skull roof of neonates. Vascularized endosteal surfaces supported rapid skeletal growth prior to hatching, promoting immediate locomotor competence.\n\nSediment infill around preserved clutches indicates episodic flooding deposited fine silts that protected eggs from desiccation. Stable isotope assays of eggshell carbonate capture paleoenvironmental humidity fluctuations."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Pachycephalosaurus developed a reinforced cranial dome and robust jaw musculature to generate powerful bite forces during plant cropping with minimal energy expenditure. Biomechanical analyses show the domal curvature attenuates occlusal stress and preserves bone integrity. Cervical muscles and ligament arrays provided precise head control for selective browsing of low vegetation. Finite-element models demonstrate stress distribution and feeding efficiency in pachycephalosaurids. Keratinous beak wear patterns indicate repeated cropping of fibrous shoots and fronds.",
                    "foodName": "small seeds",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/pachycephalosaurus/pachycephalosaurus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/pachycephalosaurus/pachycephalosaurus-food-2.png",
                    "lowerText": "Pachycephalosaurus primarily consumed low‐growing ferns, horsetails, and young angiosperm shoots, using a keratinous beak to shear tender plant tissues. Dental microwear patterns indicate minimal abrasion, suggesting selective cropping of soft foliage rather than coarse browsing. Phytoliths recovered from coprolites corroborate a diet rich in early flowering plants and fern fronds."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/pachycephalosaurus/pachycephalosaurus-characteristics.png",
                    "text": "Pachycephalosaurus possessed a massive, domed skull formed by thickened frontals and parietals, with internal trabecular architecture to absorb high‐impact forces. The short, muscular neck bore robust cervical vertebrae, while the torso was supported by a stiffened rib cage and ossified tendons along the dorsal column. Forelimbs were comparatively short with five‐digit hands, whereas the hindlimbs featured elongated metatarsals and a stiff tail counterbalancing the cranial mass. Filamentous integument traces suggest a covering of primitive protofeathers for thermoregulation. Neurovascular foramina patterns on the skull roof imply a sensitive integumentary covering, possibly used for visual display."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Pachycephalosaurus likely engaged in ritualized head‐butting contests to establish social hierarchy. Herd trackways reveal synchronized gait patterns and maintained spacing for predator vigilance. Vocalizations may have included low‐frequency rumbling calls produced by pneumatic sinus systems. Lateral dome presentations and measured head‐bobbing served as visual signals during interactions. Seasonal resource shifts prompted migrations between nesting uplands and floodplain feeding areas. Bonebeds with mixed‐age individuals indicate occasional grouping beyond immediate family units. Healed cranial lesions confirm repeated but non‐lethal impacts consistent with controlled combat. Nesting sites appear opportunistic, with shallow scrapes in well‐drained sediments. Dome height provided panoramic vantage points for early predator detection.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/pachycephalosaurus/pachycephalosaurus-behaviour.png",
                    "lowerText": "Recent CT scanning of pachycephalosaur domes reveals complex internal sinus networks and trabecular reinforcements that dissipate impact forces. Isotopic analysis of bone phosphate indicates rapid juvenile growth spurts and seasonal metabolic fluctuations. These findings refine our understanding of cranial function and life history in dome‐headed dinosaurs."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Stegosaurus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/stegosaurus/stegosaurus-birth.png",
                    "text": "Stegosaurus eggs were likely laid in shallow depressions dug into soft soils, where the adult pressed down with its hind limbs to create simple nest‐like sites. The eggs, roughly the size of a modern football, contained embryos that already displayed the early formation of dermal plates and tail spikes by mid‐development. Clutch sizes are uncertain, but estimates based on related thyreophoran dinosaurs suggest between ten and twenty eggs per nest. Incubation probably lasted two to three months, depending on ambient temperature and microclimate conditions in the Late Jurassic floodplains of North America. Hatchlings emerged fully independent, measuring around half a meter in length and weighing only a few kilograms at birth. These juveniles had small but distinct plates along their backs, which grew in both size and number as the animals matured."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Its narrow, weak jaws and small leaf‐shaped teeth were adapted for nipping and stripping rather than grinding vegetation. Fossilized gut contents from related stegosaur specimens reveal gastroliths in the stomach region, suggesting that stones aided mechanical breakdown of plant material in the digestive tract. Stegosaurus likely ingested large quantities of soft shoots and leaf matter each day to meet its energy requirements. The animal’s low‐slung head and neck could only reach vegetation up to about one meter above ground level. Frequent tooth wear and replacement cycles indicate that Stegosaurus chewed continuously.",
                    "foodName": "conifers",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/stegosaurus/stegosaurus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/stegosaurus/stegosaurus-food-2.png",
                    "lowerText": "Stegosaurus was strictly herbivorous, lacking any anatomical features for carnivory or omnivory. Its diet consisted mainly of low‐growing gymnosperms and pteridophytes, including ferns, horsetails, cycads, and primitive conifers. The absence of a chewing mechanism required reliance on gastroliths to pulverize food within a capacious gut."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/stegosaurus/stegosaurus-characteristics.png",
                    "text": "Stegosaurus reached lengths of up to nine meters and stood roughly four meters tall when measuring from the ground to the top of its plates. Its distinctive double row of large dermal plates along the spine varied in shape and orientation among different species. The function of these plates likely combined display for species recognition, defense, and thermoregulation through vascularized tissues. Paired spikes on the tail, known as the thagomizer, could deliver powerful defensive blows against predators like Allosaurus. The robust hindlimbs supported most of the animal’s weight, while much smaller forelimbs gave Stegosaurus a distinctive, arched posture. Skull material is rare, but the slender, elongated beak suggests a selective cropping of vegetation. Vertebral anatomy reveals a stiff back, with interlocked neural spines limiting lateral flexibility."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Stegosaurus was primarily a ground‐dwelling grazer, moving slowly through forested floodplains in search of low‐growing plants. It held its tail aloft and parallel to the ground, using its thagomizer spikes as a deterrent against predators. Plate orientation may have allowed lateral display signaling between individuals, possibly to establish hierarchy or mating readiness. Trackway evidence indicates that Stegosaurus often traveled in small groups of two to five individuals, suggesting at least loose social behavior. Individual stride lengths and spacing in the fossilized tracks reveal a walking speed of approximately three to five kilometers per hour. When threatened, Stegosaurus likely turned sideways to present a broad display of spikes and plates to intimidate attackers. These defensive behaviors, combined with its considerable body mass, would have made adult stegosaurs relatively safe from most predators.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/stegosaurus/stegosaurus-behaviour.png",
                    "lowerText": "Despite its massive body, Stegosaurus possessed a uniquely enlarged neural canal near the hips, once thought to house a “second brain.” This structure likely stored glycogen and helped coordinate hindlimb movements rather than acting as a true brain. "
                },
                {
                    "type": "templateImageLeft",
                    "title": "Triceratops",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/triceratops/triceratops-birth.png",
                    "text": "Triceratops eggs were laid in shallow depressions excavated by adults using their robust forelimbs and shoulder girdles. Each egg measured approximately 25 cm in diameter and contained developing embryos with distinct horn cores and frill outlines by mid-gestation. Clutch sizes remain uncertain, but nesting grounds in Late Cretaceous floodplain sediments suggest small groups of six to ten eggs per nest. Incubation likely lasted three to four months, depending on ambient temperatures and nest microenvironments derived from decomposing vegetation. Upon hatching, neonates emerged at about 60 cm in length and weighed roughly five to seven kilograms, already bearing miniature horn buds. Early bone histology indicates rapid growth rates, allowing hatchlings to double their body mass within the first three months of life."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Triceratops possessed a powerful keratinous beak shaped like a broad crescent, optimized for clipping tough vegetation. Behind the beak, three rows of closely packed, continuously replacing teeth formed dental batteries capable of shearing fibrous plant material. Each tooth in the battery had a flat occlusal surface, which aligned precisely to create a scissor-like action during chewing. The mandible of Triceratops was robust and hinged to allow both vertical and limited lateral movements, enhancing grinding efficiency. Jaw musculature, inferred from attachment scars on the skull, suggests exceptionally strong bite forces estimated at over 6,000 newtons.",
                    "foodName": "conifers",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/triceratops/triceratops-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/triceratops/triceratops-food-2.png",
                    "lowerText": "Triceratops was strictly herbivorous, subsisting primarily on low-growing angiosperms and ferns that carpeted Late Cretaceous floodplains. Its dental batteries could process tough fibrous stems, leaves, and seed-bearing structures from bennettitaleans and other gymnosperms."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/triceratops/triceratops-characteristics.png",
                    "text": "Triceratops reached lengths of up to nine meters and weighed approximately six to twelve metric tons as a fully grown adult. Its skull, among the largest of any land animal, measured over two meters in length, dominated by a broad bony frill and three prominent horns. The paired supraorbital horns above the eyes could reach lengths of one meter, while the nasal horn extended forward up to half a meter. The frill consisted of a parietal-squamosal shield that varied in shape between species and may have played roles in display and thermoregulation. Limb proportions were columnar, with sturdy humeri and femora supporting massive body mass during slow locomotion. Vertebrae featured large neural spines to anchor strong back muscles and support the heavy head-laden frill. The pelvic girdle was broad and robust, anchoring powerful caudofemoral muscles used in tail control."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Triceratops likely lived in herds of mixed-age individuals that migrated seasonally across floodplain ecosystems. Herd movement patterns inferred from trackways show coordinated group travel as they foraged for new plant growth. Individuals used horn displays and frill orientation in intraspecific communication, establishing dominance hierarchies within groups. When threatened, Triceratops faced predators like Tyrannosaurus by bracing on its sturdy limbs and lowering its head. The three horns formed a protective barrier, with the nasal and brow horns used in defensive charging or slashing motions. Courtship behavior may have involved ritualized head-butting competitions between males to secure mating rights. Vocalization through resonating chambers in the skull could have produced low-frequency calls to maintain herd cohesion. Parental care is debated, but nesting grounds show multiple nests clustered together, suggesting possible communal nesting sites. ",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/triceratops/triceratops-behaviour.png",
                    "lowerText": "Triceratops fossils are ubiquitous in the Hell Creek Formation, dating to approximately 68–66 million years ago, just before the Cretaceous–Paleogene extinction event. The genus name means “three-horned face,”."
                },
                {
                    "type": "templateImageLeft",
                    "title": "Tyrannosaurus",
                    "subtitle": "Hatching",
                    "imageLeftSrc": "/assets/img/books/adults-1/tyrannosaurus/tyrannosaurus-birth.png",
                    "text": "Tyrannosaurus rex eggs have yet to be discovered in situ, but clutches of closely related tyrannosaurids indicate nests of eight to twelve eggs laid in shallow ground scrapes. Each elongated egg likely measured around 30 cm, housing embryos that already showed early ossification of jaw bones and limb elements. Incubation periods are estimated at three to five months, depending on ambient temperatures in the Late Cretaceous floodplains of western North America. Hatchlings emerged measuring roughly one meter in length and weighing between five and ten kilograms, equipped with proportionally large heads and well-developed limb bones. Osteohistological analyses reveal rapid growth rates, with young T. rex doubling in mass several times within their first year."
                },
                {
                    "type": "templateImageBottomLeftAndTopRight",
                    "upperText": "Tyrannosaurus rex possessed a massive skull up to 1.5 m long, supported by powerful neck muscles anchoring on broad neural spines. Its jaws could open wider than two meters, lined with serrated, banana-shaped teeth up to 30 cm long, ideal for gripping and slicing through flesh. Muscle attachment scars on the quadrate and mandible indicate a bite force exceeding 50,000 N—sufficient to crush bone. Teeth were continuously replaced throughout life, maintaining a lethal edge for puncturing hide and shattering bones. The lower jaw allowed limited lateral movement, enhancing shearing action during mastication.",
                    "foodName": "dinosaurs",
                    "imageBottomLeftSrc": "/assets/img/books/adults-1/tyrannosaurus/tyrannosaurus-food-1.png",
                    "imageTopRightSrc": "/assets/img/books/adults-1/tyrannosaurus/tyrannosaurus-food-2.png",
                    "lowerText": "As an apex predator, Tyrannosaurus rex primarily hunted large ornithischians such as Edmontosaurus and Triceratops, but also scavenged carcasses when opportunities arose. Tooth‐mark patterns on hadrosaur and ceratopsian bones match T. rex dentition, confirming both active predation and carrion‐feeding behavior. Coprolites attributed to T. rex contain pulverized bone fragments, indicating consumption of marrow and dense skeletal tissue."
                },
                {
                    "type": "templateImageLeft",
                    "subtitle": "Characteristics",
                    "imageLeftSrc": "/assets/img/books/adults-1/tyrannosaurus/tyrannosaurus-characteristics.png",
                    "text": "Tyrannosaurus rex reached up to 12 m in length and weighed between 8 and 14 t at full maturity. Its skull was exceptionally deep, featuring large orbital sockets and broad temporal fenestrae to accommodate massive jaw musculature. The vertebral column comprised tall neural spines in the neck and sacrum, supporting the weight of the head and enabling powerful head thrusts. Hindlimbs were columnar and muscular, with a femur over one meter long and three weight-bearing toes ending in hoof-like claws. Forelimbs, though short (about one meter), were heavily muscled and bore two curved claws, potentially used for clutching prey. Recent skin impressions suggest a mosaic of small, pebbly scales, with evidence of protofeather filaments on juveniles."
                },
                {
                    "type": "templateImageBottomRight",
                    "upperText": "Tyrannosaurus rex likely exhibited complex social dynamics, possibly hunting in pairs or small family groups, though solitary behavior in adults is also plausible. Trackways of related tyrannosaurids show parallel paths, hinting at cooperative movement. Nesting ground evidence from close relatives implies that T. rex may have provided some degree of parental care, guarding nests and hatchlings. Courtship displays could have involved visual signals such as head bobbing, crest flashing, and roaring to attract mates and establish dominance. Ambush hunting strategies utilized dense vegetation and sudden sprints—estimated at up to 20 km/h—to surprise prey. Vocalizations through resonating chambers in the throat may have produced low‐frequency calls for long‐distance communication. Territorial disputes likely involved lateral head displays and mock charges.Feeding bouts were interspersed with rest in shaded areas to avoid overheating under the Late Cretaceous sun.",
                    "imageBottomRightSrc": "/assets/img/books/adults-1/tyrannosaurus/tyrannosaurus-behaviour.png",
                    "lowerText": "Tyrannosaurus rex lived during the Maastrichtian stage of the Late Cretaceous, about 68–66 Ma, right up to the K–Pg extinction event. Its name, meaning “tyrant lizard king,” reflects its position at the top of the food chain."
                }
            ]
        },
        {
            "isbn": "978-0262033848",
            "title": "Paletteo",
            "summary": "A playful stegosaurus named Paletteo discovers that his rainbow-tipped plates make perfect watercolor brushes. From dawn’s inspiration through a forest studio by moonlight, he paints shimmering ponds and leafy shadows before inviting friends to join his colorful mural.",
            "styles": "kids-2",
            "progress": 60,
            "image": "/assets/img/bg/base.png",
            "coverBackImage": "/assets/img/books/kids-2/book-cover-back-kids2.png",
            "coverImage": "/assets/img/books/kids-2/book-cover-kids2.png",
            "frontImage": "/assets/img/books/kids-2/kids2-front.png",
            "backImage": "/assets/img/books/kids-2/kids2-back.png",
            "pages": [
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/1.png"
                },
                {
                    "type": "templateText",
                    "title": "1. Morning Inspiration",
                    "text": "Paletteo woke in his sunlit meadow, the golden sunrays warming his scales as dew sparkled on every blade of grass. As he yawned, he spotted a rainbow of wildflowers and felt a rush of excitement—today, he would finally try painting with his plate-brushes!"
                },
                {
                    "type": "templateText",
                    "title": "2. First Brushstroke",
                    "text": "Carefully, Paletteo dipped the tip of his leftmost plate into a pool of sky-blue watercolor. He pressed it onto his canvas, giggling at the soft swirls that formed. With each gentle stroke, he watched his meadow transform into a dreamy horizon of blues and greens."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/2.png"
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/3.png"
                },
                {
                    "type": "templateText",
                    "title": "3. Spine as a Brush",
                    "text": "At the pond’s edge, Paletteo experimented with the wider plates near his tail. He twirled and tapped, creating rippling waves on the water’s surface. The sunlight danced on his brushstrokes, making the glassy pond shimmer like a living painting."
                },
                {
                    "type": "templateText",
                    "title": "4. Forest Studio",
                    "text": "Under a grand oak, Paletteo set up his easel on a fallen log. He listened to birdsong and let his plates glide over the paper, capturing patches of shadow and sunshine. Every page glowed with the forest’s magic, from the rustle of leaves to the flutter of butterflies."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/4.png"
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/5.png"
                },
                {
                    "type": "templateText",
                    "title": "5. Dinosaur Friends",
                    "text": "Drawn by the colorful flutter of Paletteo’s brushes, three friends arrived: Toby the triceratops, Bella the brontosaurus, and Rocco the raptor. They each took turns painting beside him, adding their own stripes, spots, and leafy patterns to a grand mural of friendship."
                },
                {
                    "type": "templateText",
                    "title": "6. Proud Exhibition",
                    "text": "As the day ended, Paletteo hung all six paintings on branches between the trees. Lantern fireflies lit up each work, and his dino-friends cheered. Paletteo beamed—his plates weren’t just armor, they were the perfect brushes for a watercolor adventure."
                },
                {
                    "type": "templateImage",
                    "image": "/assets/img/books/kids-2/6.png"
                }
            ]
        },
        {
            "isbn": "978-0596007126",
            "title": "Ancient Giants",
            "styles": "adults-2",
            "summary": "Journey back in time to explore the reign of Earth’s most colossal creatures, from the dawn of the Triassic through the final days of the Cretaceous. Discover how shifting climates, continental drift, and ecological rivalries shaped the rise and fall of these titanic beasts. ",
            "progress": 60,
            "image": "/assets/img/bg/base.png",
            "coverBackImage": "/assets/img/books/adults-2/book-cover-back-adults2.png",
            "coverImage": "/assets/img/books/adults-2/book-cover-adults2.png",
            "pages": []
        },
        {
            "isbn": "978-0307269997",
            "title": "Dynatomy",
            "styles": "adults-3",
            "summary": "Delve beneath the scaly skin to uncover the remarkable inner workings of dinosaurs, from hollow bones that lightened giant bodies to air-sac breathing systems rivaling modern birds. You’ll learn how massive hearts pumped through armored frames and how digestive corridors fermented tough vegetation",
            "progress": 60,
            "image": "/assets/img/bg/base.png",
            "coverBackImage": "/assets/img/books/adults-3/book-cover-back-adults3.png",
            "coverImage": "/assets/img/books/adults-3/book-cover-adults3.png",
            "pages": []
        }
    ]
}